// #include <Arduino.h>
// #include "Sensors.h"
// #include "movement.h"
// #include "API.h"   // <— ده الأهم
// // لو هتنقل Code.cpp نفسه، ضمّ الهيدر المناسب للدوال اللي فيه
// WallFollowCfg cfg;
// void setup(){
//   Serial.begin(115200);
//   sensorsInit();
//   movementInit();
// }

// extern int run_maze(int (&floodArray)[16][16], int x); // مصرح في algo_port.cpp

// void loop(){
//   // static bool once=false;
//   // if(!once){
//   //   int floodArray[16][16] = {
//   //     {14,13,12,11,10,9,8,7,7,8,9,10,11,12,13,14},
//   //     {13,12,11,10,9,8,7,6,6,7,8,9,10,11,12,13},
//   //     {12,11,10,9,8,7,6,5,5,6,7,8,9,10,11,12},
//   //     {11,10,9,8,7,6,5,4,4,5,6,7,8,9,10,11},
//   //     {10,9,8,7,6,5,4,3,3,4,5,6,7,8,9,10},
//   //     {9,8,7,6,5,4,3,2,2,3,4,5,6,7,8,9},
//   //     {8,7,6,5,4,3,2,1,1,2,3,4,5,6,7,8},
//   //     {7,6,5,4,3,2,1,0,0,1,2,3,4,5,6,7},
//   //     {7,6,5,4,3,2,1,0,0,1,2,3,4,5,6,7},
//   //     {8,7,6,5,4,3,2,1,1,2,3,4,5,6,7,8},
//   //     {9,8,7,6,5,4,3,2,2,3,4,5,6,7,8,9},
//   //     {10,9,8,7,6,5,4,3,3,4,5,6,7,8,9,10},
//   //     {11,10,9,8,7,6,5,4,4,5,6,7,8,9,10,11},
//   //     {12,11,10,9,8,7,6,5,5,6,7,8,9,10,11,12},
//   //     {13,12,11,10,9,8,7,6,6,7,8,9,10,11,12,13},
//   //     {14,13,12,11,10,9,8,7,7,8,9,10,11,12,13,14}
//   //   };
//   //   run_maze(floodArray, 0);  // هينادي API::* وفعلًا يحرك الروبوت
//   //   once=true;
//   // }
//   // delay(1000);
//   delay(2000);
//   // driveCell_WF(1,cfg);
//   // turnLeft90_MPU(110,2.0f);
//   // driveCell_WF(1,cfg);
//   // turnLeft90_MPU(110,2.0f);
//   // driveCell_WF(3,cfg);
//   // turnLeft90_MPU(110,2.0f);
//   // driveCell_WF(3,cfg);
//   // turnLeft90_MPU(110,2.0f);
//   // driveCell_WF(1,cfg);
//   //  turnLeft90_MPU(110,2.0f);
//   //  driveCell_WF(1,cfg);
//   //  turnRight90_MPU(110,2.0f);
//   //  driveCell_WF(1,cfg);
//   driveCell_WF(3,cfg);
//   turnLeft90_MPU(110,2.0f);
//   while (1)
//   {
//   }
  
 
// }
